In [1]:
import numpy as np
import pandas as pd

### Series

In [3]:
labels=['a','b','c']
my_list=[10,20,30]
arr=np.array([10,20,30])
dic={'a':10,'b':20,'c':30}

In [4]:
pd.Series(data=my_list)

0    10
1    20
2    30
dtype: int64

In [5]:
pd.Series(data=my_list,index=labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_list,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(arr)

0    10
1    20
2    30
dtype: int64

In [8]:
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [9]:
pd.Series(dic)

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [11]:
# Mesmo funções (embora seja improvável que você use isso)
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [20]:
arr1=np.arange(1,5)
arr2=np.arange(1,5)

In [21]:
ser01=pd.Series(arr1,index=['EUA', 'Alemanha','USSR', 'Japão'])

In [22]:
ser01

EUA         1
Alemanha    2
USSR        3
Japão       4
dtype: int64

In [23]:
ser02=pd.Series(arr2,index=['Italia', 'Alemanha','EUA', 'Japão'])

In [24]:
ser02

Italia      1
Alemanha    2
EUA         3
Japão       4
dtype: int64

In [25]:
ser01+ser02

Alemanha    4.0
EUA         4.0
Italia      NaN
Japão       8.0
USSR        NaN
dtype: float64

### DataFrames

In [2]:
np.random.seed(101)

In [3]:
np.random.randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [6]:
df=pd.DataFrame(np.random.randn(5,5),index='1 2 3 4 5'.split(),columns='A B C D E'.split())

In [7]:
df

          A         B         C         D         E
1  1.035125 -0.031160  1.939932 -1.005187 -0.741790
2  0.187125 -0.732845 -1.382920  1.482495  0.961458
3 -2.141212  0.992573  1.192241 -1.046780  1.292765
4 -1.467514 -0.494095 -0.162535  0.485809  0.392489
5  0.221491 -0.855196  1.541990  0.666319 -0.538235

In [9]:
df2=pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [10]:
df2

          W         X         Y         Z
A -0.568581  1.407338  0.641806 -0.905100
B -0.391157  1.028293 -1.972605 -0.866885
C  0.720788 -1.223082  1.606780 -1.115710
D -1.385379 -1.329660  0.041460 -0.411055
E -0.771329  0.110477 -0.804652  0.253548

In [17]:
df2['W']

A   -0.568581
B   -0.391157
C    0.720788
D   -1.385379
E   -0.771329
Name: W, dtype: float64

In [18]:
# Passando uma lista com nomes das colunas
df2[['W','Z']]

          W         Z
A -0.568581 -0.905100
B -0.391157 -0.866885
C  0.720788 -1.115710
D -1.385379 -0.411055
E -0.771329  0.253548

In [19]:
# Sintaxe SQL (Não recomendado!)
df2.W

A   -0.568581
B   -0.391157
C    0.720788
D   -1.385379
E   -0.771329
Name: W, dtype: float64

As colunas dos DataFrames são Series

In [21]:
type(df2['W'])

pandas.core.series.Series

** Criando uma coluna: **

In [22]:
df2['new']=df2['W']+df2['Y']

In [23]:
df2

          W         X         Y         Z       new
A -0.568581  1.407338  0.641806 -0.905100  0.073224
B -0.391157  1.028293 -1.972605 -0.866885 -2.363762
C  0.720788 -1.223082  1.606780 -1.115710  2.327567
D -1.385379 -1.329660  0.041460 -0.411055 -1.343919
E -0.771329  0.110477 -0.804652  0.253548 -1.575980

** Removendo colunas **

In [26]:
df2.drop('new',axis=1)

          W         X         Y         Z
A -0.568581  1.407338  0.641806 -0.905100
B -0.391157  1.028293 -1.972605 -0.866885
C  0.720788 -1.223082  1.606780 -1.115710
D -1.385379 -1.329660  0.041460 -0.411055
E -0.771329  0.110477 -0.804652  0.253548

In [27]:
df2

          W         X         Y         Z       new
A -0.568581  1.407338  0.641806 -0.905100  0.073224
B -0.391157  1.028293 -1.972605 -0.866885 -2.363762
C  0.720788 -1.223082  1.606780 -1.115710  2.327567
D -1.385379 -1.329660  0.041460 -0.411055 -1.343919
E -0.771329  0.110477 -0.804652  0.253548 -1.575980

In [28]:
df2.drop('new',axis=1,inplace=True)

In [29]:
df2

          W         X         Y         Z
A -0.568581  1.407338  0.641806 -0.905100
B -0.391157  1.028293 -1.972605 -0.866885
C  0.720788 -1.223082  1.606780 -1.115710
D -1.385379 -1.329660  0.041460 -0.411055
E -0.771329  0.110477 -0.804652  0.253548

Também podemos deletar linhas desta forma:

In [30]:
df2.drop('E',axis=0)

          W         X         Y         Z
A -0.568581  1.407338  0.641806 -0.905100
B -0.391157  1.028293 -1.972605 -0.866885
C  0.720788 -1.223082  1.606780 -1.115710
D -1.385379 -1.329660  0.041460 -0.411055

In [31]:
df2

          W         X         Y         Z
A -0.568581  1.407338  0.641806 -0.905100
B -0.391157  1.028293 -1.972605 -0.866885
C  0.720788 -1.223082  1.606780 -1.115710
D -1.385379 -1.329660  0.041460 -0.411055
E -0.771329  0.110477 -0.804652  0.253548

** Selecionando linhas: **

In [33]:
df2.loc['A']

W   -0.568581
X    1.407338
Y    0.641806
Z   -0.905100
Name: A, dtype: float64

Ou selecione com base na posição em vez do rótulo

In [37]:
df2.iloc[0]

W   -0.568581
X    1.407338
Y    0.641806
Z   -0.905100
Name: A, dtype: float64

** Selecionando o subconjunto de linhas e colunas **

In [38]:
df2.loc['B','Y']

-1.9726051036093835

In [40]:
df2.loc[['A','B'],['W','Y']]

          W         Y
A -0.568581  0.641806
B -0.391157 -1.972605

In [41]:
df2>0

       W      X      Y      Z
A  False   True   True  False
B  False   True  False  False
C   True  False   True  False
D  False  False   True  False
E  False   True  False   True

In [42]:
df2[df2>0]

          W         X         Y         Z
A       NaN  1.407338  0.641806       NaN
B       NaN  1.028293       NaN       NaN
C  0.720788       NaN  1.606780       NaN
D       NaN       NaN  0.041460       NaN
E       NaN  0.110477       NaN  0.253548

In [46]:
df2[df2['W']>0]

          W         X        Y        Z
C  0.720788 -1.223082  1.60678 -1.11571

In [49]:
df2[df2['W']>0]['Y']

C    1.60678
Name: Y, dtype: float64

In [50]:
df2[df2['W']>0][['Y','Z']]

         Y        Z
C  1.60678 -1.11571

Para duas condições, você pode usar | e & com parênteses:

In [51]:
df2[(df2['W']>0)&(df2['Y']>1)]

          W         X        Y        Z
C  0.720788 -1.223082  1.60678 -1.11571

Redefinir para o padrão 0,1 ... n índice

In [53]:
df2

          W         X         Y         Z
A -0.568581  1.407338  0.641806 -0.905100
B -0.391157  1.028293 -1.972605 -0.866885
C  0.720788 -1.223082  1.606780 -1.115710
D -1.385379 -1.329660  0.041460 -0.411055
E -0.771329  0.110477 -0.804652  0.253548

In [54]:
df2.reset_index()

  index         W         X         Y         Z
0     A -0.568581  1.407338  0.641806 -0.905100
1     B -0.391157  1.028293 -1.972605 -0.866885
2     C  0.720788 -1.223082  1.606780 -1.115710
3     D -1.385379 -1.329660  0.041460 -0.411055
4     E -0.771329  0.110477 -0.804652  0.253548

In [56]:
novoind = 'CA NY WY OR CO'.split()

In [58]:
novoind

['CA', 'NY', 'WY', 'OR', 'CO']

In [59]:
df2['estados'] = novoind

In [60]:
df2

          W         X         Y         Z estados
A -0.568581  1.407338  0.641806 -0.905100      CA
B -0.391157  1.028293 -1.972605 -0.866885      NY
C  0.720788 -1.223082  1.606780 -1.115710      WY
D -1.385379 -1.329660  0.041460 -0.411055      OR
E -0.771329  0.110477 -0.804652  0.253548      CO

In [61]:
df2.set_index('estados')

                W         X         Y         Z
estados
CA      -0.568581  1.407338  0.641806 -0.905100
NY      -0.391157  1.028293 -1.972605 -0.866885
WY       0.720788 -1.223082  1.606780 -1.115710
OR      -1.385379 -1.329660  0.041460 -0.411055
CO      -0.771329  0.110477 -0.804652  0.253548

In [63]:
df2

          W         X         Y         Z estados
A -0.568581  1.407338  0.641806 -0.905100      CA
B -0.391157  1.028293 -1.972605 -0.866885      NY
C  0.720788 -1.223082  1.606780 -1.115710      WY
D -1.385379 -1.329660  0.041460 -0.411055      OR
E -0.771329  0.110477 -0.804652  0.253548      CO

In [64]:
df2.set_index('estados',inplace=True)

In [65]:
df2

                W         X         Y         Z
estados
CA      -0.568581  1.407338  0.641806 -0.905100
NY      -0.391157  1.028293 -1.972605 -0.866885
WY       0.720788 -1.223082  1.606780 -1.115710
OR      -1.385379 -1.329660  0.041460 -0.411055
CO      -0.771329  0.110477 -0.804652  0.253548

Vamos examinar como trabalhar com o Multi-Index, primeiro criaremos um exemplo rápido de como seria um DataFrame Multi-Indexado:

In [7]:
#Niveis de indices
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [8]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [9]:
df = pd.DataFrame(np.random.randn(6,2),index=hier_index,columns=['A','B'])

In [10]:
df

             A         B
G1 1 -0.327452  1.100203
   2 -1.775517 -0.909731
   3  0.471647 -0.965359
G2 1  0.759758 -0.658952
   2  0.263583 -1.236536
   3 -0.310170 -1.847380

Agora vamos mostrar como indexar isso! Para a hierarquia de índice, usamos df.loc []. Se este fosse no eixo das colunas, você usaria a notação de suporte normal df []. Chamar um nível do índice retorna um sub-dataframe:

In [12]:
df['B']

G1  1    1.100203
    2   -0.909731
    3   -0.965359
G2  1   -0.658952
    2   -1.236536
    3   -1.847380
Name: B, dtype: float64

In [19]:
df.loc['G1']

          A         B
1 -0.327452  1.100203
2 -1.775517 -0.909731
3  0.471647 -0.965359

In [20]:
df.loc['G2','B']

1   -0.658952
2   -1.236536
3   -1.847380
Name: B, dtype: float64

In [21]:
df.index.names

FrozenList([None, None])

In [23]:
df.index.names=['Group','Number']

In [24]:
df

                     A         B
Group Number
G1    1      -0.327452  1.100203
      2      -1.775517 -0.909731
      3       0.471647 -0.965359
G2    1       0.759758 -0.658952
      2       0.263583 -1.236536
      3      -0.310170 -1.847380

In [26]:
df.xs('G1')

               A         B
Number
1      -0.327452  1.100203
2      -1.775517 -0.909731
3       0.471647 -0.965359

In [33]:
df.xs(['G1',1])

A   -0.327452
B    1.100203
Name: (G1, 1), dtype: float64

In [34]:
df.xs(1,level='Number')

              A         B
Group
G1    -0.327452  1.100203
G2     0.759758 -0.658952

## Dados ausentes

In [36]:
df3=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]})

In [37]:
df3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [38]:
df3.dropna()

     A    B  C
0  1.0  5.0  1

In [40]:
df3.dropna(axis=1)

   C
0  1
1  2
2  3

In [42]:
df3.dropna(axis=0)

     A    B  C
0  1.0  5.0  1

In [43]:
df3.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [47]:
df3.fillna(value='count')

       A      B  C
0      1      5  1
1      2  count  2
2  count  count  3

In [48]:
df3.fillna(value=0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [56]:
df3['A'].fillna(value=df3['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [51]:
df3['A'].fillna(value=df3['A'].mean(),inplace=True)

In [52]:
df3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  1.5  NaN  3

In [57]:
df3['B'].fillna(value=df3['B'].mean(),inplace=True)

In [58]:
df3

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

## Groupby

In [64]:
# Cria um DataFrame
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Name':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [65]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Name': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [67]:
df4=pd.DataFrame(data)

In [68]:
df4

  Company     Name  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

** Agora, você pode usar o método .group by () para agrupar as linhas em conjunto com base em um nome de coluna. Por exemplo, vamos agrupar com base na empresa. Isso criará um objeto DataFrameGroupBy:**

In [69]:
df4.groupby('Company')

In [70]:
company=df4.groupby('Company')

In [71]:
company

In [73]:
name=df4.groupby('Name')

In [74]:
name

In [75]:
company.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [76]:
company.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [77]:
company.min()

            Name  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [78]:
company.max()

            Name  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [79]:
company.count()

         Name  Sales
Company
FB          2      2
GOOG        2      2
MSFT        2      2

In [80]:
company.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [81]:
name.sum()

         Sales
Name
Amy        340
Carl       243
Charlie    120
Sam        200
Sarah      350
Vanessa    124

In [82]:
company.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [83]:
name.describe()

        Sales
        count   mean std    min    25%    50%    75%    max
Name
Amy       1.0  340.0 NaN  340.0  340.0  340.0  340.0  340.0
Carl      1.0  243.0 NaN  243.0  243.0  243.0  243.0  243.0
Charlie   1.0  120.0 NaN  120.0  120.0  120.0  120.0  120.0
Sam       1.0  200.0 NaN  200.0  200.0  200.0  200.0  200.0
Sarah     1.0  350.0 NaN  350.0  350.0  350.0  350.0  350.0
Vanessa   1.0  124.0 NaN  124.0  124.0  124.0  124.0  124.0

In [85]:
company.describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [86]:
company.describe().transpose()['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

## Concat, Merge and Join

In [2]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [3]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [4]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [5]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [6]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [7]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [8]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [7]:
pd.concat([df1,df2,df3],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [9]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [10]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [11]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

A função ** mesclar ** permite que você mescle os quadros de dados juntos usando uma lógica semelhante à mesclagem de tabelas SQL juntas. Por exemplo:

In [12]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [13]:
left1 = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right1 = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [14]:
pd.merge(left1,right1,on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [15]:
pd.merge(left1,right1,how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [16]:
pd.merge(left1,right1,how='right',on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [17]:
pd.merge(left1,right1,how='left',on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

Join é um método conveniente para combinar as colunas de dois DataFrames indexados potencialmente diferentes em um único resultado DataFrame.

In [18]:
left2 = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right2 = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [19]:
left2

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [20]:
right2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [21]:
left2.join(right2)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [22]:
left2.join(right2,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3